Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: However, dragging via SendPlay might not work in RichEdit controls (and possibly others) such as those of WordPad and Metapad.
ja: ただし、WordPadやMetapadなどのRichEditコントロールでは、SendPlayによるドラッグが効かない場合があります（他のコントロールも可能性があります）。

source: However, due to the way methods work for Objects, WhichClass.NestedClass() implicitly passes WhichClass as the first parameter, equivalent to WhichClass.NestedClass.Call(WhichClass).
ja: しかし、オブジェクトに対するメソッドの動作方法のため、WhichClass.NestedClass()は、WhichClassを最初のパラメータとして暗黙的に渡しており、WhichClass.NestedClass.Call(WhichClass)と同等です。

source: However, for dynamic calls, the function is often written to suit the function call, and in such cases failure might be caused by a mistake in the function definition rather than incorrect parameter values.
ja: しかし、動的呼び出しの場合、関数呼び出しに合わせて関数を書くことが多く、その場合、パラメータ値の誤りではなく、関数定義の誤りが原因で失敗することがあります。

source: However, for practical reasons these are almost always treated as two individual units (referred to as "characters" for simplicity).
ja: しかし、実用上の理由から、これらはほとんどの場合、2つの個別のユニット（簡単のために「文字」と呼ばれる）として扱われます。

source: However, functions that wait such as Sleep and WinWait will check messages regardless of this setting (a workaround is DllCall("Sleep", "UInt", 500)).
ja: ただし、Sleepや WinWaitなどの待機する関数は、この設定に関係なくメッセージをチェックします（回避策はDllCall("Sleep", "UInt", 500))。

source: However, hotkeys above level 0 always use the keyboard or mouse hook.
ja: ただし、レベル0以上のホットキーは、常にキーボードまたはマウスフックを使用します。

source: However, hotkeys with the # modifier can be triggered by either Win.
ja: ただし、# 修飾子を含むホットキーは、Winのいずれかでトリガーできます。

source: However, if DetectHiddenText has been turned off, hidden text is omitted from the return value.
ja: ただし、DetectHiddenTextがオフになっているときは、隠しテキストは戻り値から省かれます。

source: However, if a GUI is sized for a screen with 100 % DPI and then moved to a screen with 200 % DPI, it will not adjust automatically, and may be very hard to use.
ja: しかし、GUIが100 %のDPIのスクリーン用にサイズ調整され、その後200 %のDPIのスクリーンに移動した場合、自動的に調整されず、非常に使いにくくなる可能性があります。

source: However, if a hotkey needs to execute only a single line, that line can be listed to the right of the double-colon.
ja: ただし、ホットキーが1つの行だけを実行する必要がある場合は、その行をダブルコロンの右側にリストアップすることができます。

source: However, if a label is placed immediately above Case or Default, it targets the end of the previous case, not the beginning of the next one.
ja: しかし、ラベルがCaseまたはDefaultのすぐ上に置かれた場合、次のケースの始まりではなく、前のケースの終わりをターゲットとする。

source: However, if a thread needs to display both owned and unowned dialogs, it may turn off this setting via MyGui.Opt("-OwnDialogs").
ja: ただし、スレッドが所有と未所有の両方のダイアログを表示する必要がある場合は、MyGui.Opt("-OwnDialogs")によってこの設定をオフにすることができます。

source: However, if a tilde is applied to the prefix key of any custom combination which has not been turned off or suspended, it affects the behavior of that prefix key for all combinations.
ja: ただし、オフやサスペンドされていないカスタムコンビネーションのプレフィックスキーにチルダを適用すると、すべてのコンビネーションに対してそのプレフィックスキーの動作に影響を与えます。

source: However, if a variable is used in an assignment or with the reference operator (&), it is automatically local by default.
ja: ただし、変数が代入や参照演算子(&)で使用された場合、デフォルトで自動的にローカルになります。

source: However, if an always-on-top window also matches (and the active window is not always-on-top), it may be used instead.
ja: ただし、常時オンのウィンドウも一致する場合（そしてアクティブなウィンドウが常時オンでない場合）には、そのウィンドウが代わりに使われることもある。

source: However, if an editor window appears to have the script already open (based on its window title), that window is activated instead of opening a new instance of the editor.
ja: ただし、エディターウィンドウにスクリプトがすでに開かれているように見える場合（ウィンドウタイトルに基づく）、エディターの新しいインスタンスを開くのではなく、そのウィンドウが起動されます。

source: However, if execution is prevented from reaching the class definition, such as by return or an infinite loop, the class is initialized only if it is referenced.
ja: しかし、returnや無限ループなど、実行がクラス定義に到達できない場合は、クラスが参照されている場合のみ初期化される。

source: However, if more than one control has the same shortcut key, pressing the shortcut will alternate keyboard focus among all controls with the same shortcut.
ja: ただし、複数のコントロールが同じショートカットキーを持つ場合、ショートカットキーを押すと、同じショートカットキーを持つすべてのコントロールの間でキーボードフォーカスが交互に変わります。

source: However, if only one line belongs to an Else, the braces are optional.
ja: ただし、1行だけがElseに属する場合は、中括弧は省略可能です。

source: However, if only one line belongs to an If, the braces are optional.
ja: ただし、1つのIfに1行しか属さない場合は、中括弧は省略可能です。

source: However, if the keyboard hook is not installed and KeyName is a keyboard key released artificially by means such as the Send function, the key will be seen as having been physically released.
ja: ただし、キーボードフックが装着されておらず、KeyNameが Send関数などで人為的に解放されたキーボードキーである場合は、物理的に解放されたとみなされます。

source: However, if the E option is also present, the new display area will be an ellipse rather than a rectangle.
ja: ただし、Eオプションも存在する場合、新しい表示領域は矩形ではなく楕円になる。

source: However, if the ListView shares ImageLists with other ListViews (by having 0x40 in its options), the script should explicitly destroy the ImageList after destroying all the ListViews that use it.
ja: しかし、ListViewが他のListViewとImageListを共有している場合（オプションに0x40を持つことによって）、スクリプトはそれを使用するすべてのListViewを破棄した後、明示的にImageListを破棄する必要があります。

source: However, if the active window is moved to the bottom of the stack with WinMoveBottom, some other window may be activated even if the active window is a match.
ja: しかし、WinMoveBottomでアクティブ・ウィンドウをスタックの一番下に移動させると、アクティブ・ウィンドウが一致しても、他のウィンドウがアクティブになることがある。

source: However, if the buddy is a ListBox, the ListBox's current selection is changed instead.
ja: ただし、バディがリストボックスの場合は、リストボックスの現在の選択範囲が変更されます。

source: However, if the function allocates memory and expects the caller to free it (such as by calling CoTaskMemFree), the Ptr* arg type must be used instead.
ja: しかし、関数がメモリを確保し、呼び出し側がそれを解放することを期待する場合（CoTaskMemFreeを呼び出すなど）、代わりにPtr*arg型を使用する必要があります。

source: However, if the function is already registered, the order will not change unless it is unregistered and then re-registered.
ja: ただし、すでに機能が登録されている場合は、一度登録を解除し、再度登録しない限り、順番は変わりません。

source: However, if the function object held by the callback is of a dynamic nature (such as a closure or bound function), it can be especially important to free the callback when it is no longer needed; otherwise, the function object will not be released.
ja: しかし、コールバックが保持する関数オブジェクトが動的な性質を持つ場合（クロージャや バインド関数など）、コールバックが不要になったときに解放することが特に重要になる場合があります。

source: However, if the number begins with a plus or minus sign, the setting will be toggled (set to the opposite of its current state).
ja: ただし、数字がプラス記号またはマイナス記号で始まる場合、その設定はトグルされる（現在の状態とは逆の状態に設定される）。

source: However, if the outer function is assume-global, nested functions behave as though assume-global by default, except that they can refer to local and static variables of the outer function.
ja: ただし、外側の関数がassume-globalの場合、入れ子になった関数は、外側の関数のローカル変数やスタティック変数を参照できる以外は、デフォルトでassume-globalと同じように動作します。

source: However, if the owner window is eligible for activation, the most recently active owned window is activated instead, unless the owner was active more recently.
ja: ただし、オーナーウィンドウがアクティブ化の対象となる場合、オーナーがより最近アクティブ化した場合を除き、最も最近アクティブ化したオーナーウィンドウが代わりにアクティブ化されます。

source: However, if the specified scrolling width is smaller than the width of the ListBox, no scroll bar will be shown (though the mere presence of HScroll makes it possible for the horizontal scroll bar to be added later via MyScrollBar.Opt("+HScroll500"), which is otherwise impossible).
ja: ただし、指定したスクロール幅がListBoxの幅より小さい場合は、スクロールバーは表示されません（ただし、HScrollが存在するだけで、MyScrollBar.Opt("+HScroll500")によって水平スクロールバーを後から追加することは可能ですが、他の方法では不可能です）。

source: However, if the user presses a hotkey, selects a custom menu item, or performs a GUI action such as pressing a button, that event will be buffered until later; in other words, its subroutine will be performed after the clipboard finally becomes available.
ja: しかし、ユーザーがホットキーを押したり、カスタムメニューを選択したり、ボタンを押すなどのGUIアクションを行った場合、そのイベントは後までバッファされます。言い換えれば、そのサブルーチンはクリップボードが最終的に利用可能になった後に実行されます。

source: However, if two numbers differ only by the presence of a leading zero, the string with leading zero may be considered less than the other string.
ja: しかし、2つの数値が先頭のゼロの有無によってのみ異なる場合、先頭のゼロがある文字列は、もう一方の文字列よりも小さいとみなされることがある。

source: However, if you do this without first having assigned a custom window via Gui.BackColor, buttons will also become transparent.
ja: ただし、Gui.BackColorでカスタムウィンドウを割り当てずにこの操作を行うと、ボタンも透明になります。

source: However, if you wish these keypresses to be buffered rather than ignored -- perhaps to increase the responsiveness of the keyboard's auto-repeat feature -- use #MaxThreadsBuffer.
ja: しかし、キーボードのオートリピート機能の応答性を高めるために、これらのキー入力を無視するのではなく、バッファリングしたい場合は、#MaxThreadsBufferを使用します。

source: However, in many cases it is simpler and more efficient to specify multiple Type, Number pairs instead.
ja: しかし、多くの場合、代わりに複数のTypeとNumberのペアを指定する方がシンプルで効率的です。

source: However, in some cases the exact type of a value is more important.
ja: しかし、値の正確な型の方が重要な場合もあります。

source: However, in some cases these modifier events may interfere with the active window, especially if the user is actively typing during a ControlSend or if Alt is being sent (since Alt activates the active window's menu bar).
ja: 特に、ControlSend中にユーザーが積極的にタイピングしている場合や、Altが送信されている場合（Altはアクティブウィンドウのメニューバーをアクティブにするため）には、これらの修飾子イベントがアクティブウィンドウに干渉する場合があります。

source: However, in that case the working directory is never used, and the root is \\?\ (for example, \\?\C:\.. resolves to \\?\ whereas C:\.. resolves to C:\).
ja: しかし、その場合、作業ディレクトリは決して使用されず、ルートは\\?\（例えは、\\?\C:\..は、\\?\に解決され、C:\..は、C:\に解決される）。

source: However, in the absence of hotkeys and hotstrings, a script will perform its functions sequentially from top to bottom the moment it is launched.
ja: しかし、ホットキーやホットストリングがない場合、スクリプトは起動した瞬間に上から下へと順次機能を実行する。

source: However, in this case the last two parameters should be specified to ensure correct behavior:
ja: ただし、この場合、正しい動作を保証するために、最後の2つのパラメータを指定する必要があります：

source: However, it also causes the non-client area (title bar) to scale, which may cause the window's client area to be too small unless the script is designed to adjust for it (such as by responding to the WM_DPICHANGED message).
ja: しかし、非クライアント領域（タイトル・バー）も拡大縮小されるため、スクリプトが（WM_DPICHANGEDメッセージに応答するなどして）調整するように設計されていない限り、ウィンドウのクライアント領域が小さくなりすぎる可能性があります。

source: However, it does apply to changes in the state of the modifier keys (Shift, Ctrl, Alt, and Win), which affects remappings such as a::B or a::^b.
ja: ただし、修飾キー（Shift、Ctrl、Alt、Win）の状態の変化には適用され、a::Bや a::^bのようなリマッピングに影響する。

source: However, it does this by skipping path normalization.
ja: しかし、これはパスの正規化をスキップすることによって行われる。

source: However, it is less accurate for other purposes such as detecting controls inside a GroupBox control.
ja: ただし、GroupBoxコントロール内のコントロールの検出など、他の目的では精度が落ちます。

source: However, it is safer to utilize the rule below; that is, always enclose the expression (or just the condition) in parentheses.
ja: ただし、式（または条件）を常に括弧で囲むという、以下のルールを利用するのが無難です。

source: However, it is still not considered an error to copy or move zero files when the source path contains wildcards.
ja: ただし、ソースパスにワイルドカードが含まれている場合、0個のファイルをコピーまたは移動することは、依然としてエラーとはみなされません。

source: However, it is usually better to use ComCall, which streamlines this process.
ja: しかし、通常はこのプロセスを合理化するComCallを使用するのがよいでしょう。

source: However, it is usually not necessary to do this because the physical reordering of columns does not affect the column order seen by the script.
ja: しかし、列の物理的な並び替えは、スクリプトが見る列の順序に影響を与えないので、通常はこれを行う必要はありません。

source: However, it will be interrupted (and the script will terminate) if the user chooses Exit from the tray menu or main menu, or the script is asked to terminate as a result of Reload or #SingleInstance.
ja: ただし、トレイメニューやメインメニューでユーザーが「終了」を選択した場合や、Reloadや #SingleInstanceの結果、スクリプトの終了を求められた場合は、中断されます（スクリプトも終了します）。

source: However, joystick hotkeys always pass through, whether they are disabled or not.
ja: ただし、ジョイスティックのホットキーは、無効化されていてもされていなくても常に通過します。

source: However, key-repeat occurs even for Win if it was the last key physically pressed, so it can be hard to predict when the most recent Win keydown was.
ja: ただし、キーリピートは、物理的に最後に押されたキーであればWinでも発生するため、直近のWinのキーがいつダウンするかを予測することは困難です。

source: However, keys must be spelled consistently.
ja: ただし、キーは一貫したスペルで表記する必要があります。

source: However, locking the drive while it is open will probably result in it becoming locked the moment it is closed.
ja: ただし、ドライブを開いた状態でロックをかけると、閉じた瞬間にロックがかかってしまう可能性があります。

source: However, messages which are sent rather than posted cannot be buffered as they must provide a return value.
ja: しかし、投稿ではなく送信されるメッセージは、戻り値を提供する必要があるため、バッファリングすることはできません。

source: However, mouse hotkeys and both Win themselves (~LWin:: and ~RWin::) do not suppress the Start Menu.
ja: ただし、マウスのホットキーや両Win自身（~LWin::、~RWin::）は、スタートメニューを抑制しません。

source: However, note that running the script as admin causes all programs launched by the script to also run as admin.
ja: ただし、スクリプトを管理者として実行すると、スクリプトによって起動されるすべてのプログラムも管理者として実行されることに注意してください。

source: However, note that when assigning to an Array, the index must be within the range of 1 to the array's current length.
ja: ただし、配列に代入する場合は、インデックスが1から配列の現在の長さの範囲内になければならないことに注意。

source: However, nothing else grants you permission to modify or distribute the Program or its derivative works.
ja: しかし、『プログラム』やその派生物を改変したり頒布したりする許可をあなたに与えるものは他にありません。

source: However, optional parameters may be omitted from the middle of the parameter list when calling the function, as shown below:
ja: ただし、オプションのパラメータは、以下のように、関数を呼び出す際に、パラメータリストの途中から省略することができます：

source: However, other file types (.mp3, .avi, etc.) might not be playable if the right codecs or features aren't installed on the system.
ja: ただし、適切なコーデックや機能がシステムにインストールされていない場合、その他のファイルタイプ（.mp3、.aviなど）は再生できない可能性があります。

source: However, parties who have received copies, or rights, from you under this License will not have their licenses terminated so long as such parties remain in full compliance.
ja: ただし、本許諾書に基づいてあなたから複製物や権利を受け取った当事者は、その当事者が完全なコンプライアンスを維持している限り、そのライセンスが終了することはありません。

source: However, performance is slightly reduced because the target label must be "looked up" each time rather than only once when the script is first loaded.
ja: しかし、スクリプトが最初にロードされたときに一度だけではなく、毎回ターゲット・ラベルを「ルックアップ」しなければならないため、パフォーマンスは若干低下する。

source: However, pressing Ctrl+Alt+Del will re-enable input due to a Windows API feature.
ja: ただし、Ctrl+Alt+Delを押すと、Windows APIの機能により、入力が再有効化されます。

source: However, primitive values support the same kind of delegation as objects.
ja: しかし、プリミティブ値はオブジェクトと同じようなデリゲーションをサポートする。

source: However, removing the current image with GuiCtrl.Value := "" is permitted.
ja: ただし、GuiCtrl.Value := ""で現在の画像を削除することは可能です。

source: However, removing these lines also prevents the plus/minus buttons from being shown for top-level items.
ja: しかし、これらの行を削除すると、トップレベルのアイテムにプラス/マイナスボタンが表示されなくなる。

source: However, see alt-tab issues.
ja: ただし、alt-tabの問題を参照。

source: However, see above.
ja: ただし、上記を参照のこと。

source: However, sending {CapsLock} might require SetStoreCapsLockMode False beforehand.
ja: ただし、{CapsLock}を送信する場合は、あらかじめSetStoreCapsLockMode Falseが必要な場合があります。

source: However, setting a non-existent property will create it in most cases.
ja: ただし、存在しないプロパティを設定すると、ほとんどの場合、作成されます。

source: However, since Critical is a thread-specific setting, when a critical thread ends, the underlying/resumed thread (if any) will be automatically noncritical.
ja: ただし、Criticalはスレッド固有の設定なので、Criticalなスレッドが終了すると、その下にある/再開されたスレッド（もしあれば）は自動的にNoncriticalになります。

source: However, since SendInput is unable to detect a low-level hook in programs other than AutoHotkey v1.0.43+, it will not revert in these cases, making it less reliable than SendPlay/Event.
ja: ただし、SendInputはAutoHotkey v1.0.43+以外のプログラムでは低レベルフックを検出できないため、これらの場合は復帰せず、SendPlay/Eventより信頼性が低くなります。

source: However, since a primitive value is not an Object and cannot have its own properties or methods, the primitive prototype objects do not derive from Object.Prototype.
ja: しかし、プリミティブ値はObjectではなく、独自のプロパティやメソッドを持つことができないため、プリミティブプロトタイプオブジェクトはObject.Prototypeから派生しません。

source: However, since hotstrings with C or ? are considered distinct from other hotstrings, it is not possible to add or remove these options.
ja: ただし、Cや ?が付いたホットストリングは他のホットストリングと区別して考えるため、これらのオプションを追加したり削除したりすることはできません。

source: However, since label-and-return based subroutines can now be completely avoided, the auto-execute section is able to span the entire script.
ja: しかし、ラベルとリターンに基づくサブルーチンを完全に回避できるようになったため、自動実行セクションはスクリプト全体に及ぶことができるようになりました。

source: However, since remapping uses Send "{Blind}" and since the SendPlay mode does not fully support {Blind}, some remappings might not function properly in SendPlay mode (especially Ctrl, Shift, Alt, and Win).
ja: しかし、リマッピングはSend "{Blind}"を使用し、SendPlayモードは{Blind}を完全にはサポートしていないため、一部のリマッピングはSendPlayモードでは正しく機能しない可能性があります（特にCtrl、Shift、Alt、Win）。

source: However, some applications do not obey a ClickCount value higher than 1 for the mouse wheel.
ja: ただし、アプリケーションによっては、マウスホイールのClickCountの値が1以上であることに従わないものもあります。

source: However, some applications require that the modifier keys be released.
ja: ただし、アプリケーションによっては、修飾キーが解放されている必要があります。

source: However, some built-in functions may "see" only the part of the string preceding the first null character.
ja: しかし、組み込み関数によっては、最初のヌル文字に先立つ文字列の一部だけを「見る」ことができる。

source: However, some code pages contain characters which are represented by sequences of multiple bytes (these are always non-ASCII characters).
ja: ただし、コードページによっては、複数バイトのシーケンスで表現される文字（これらは常に非ASCII文字である）が含まれています。

source: However, some games do not support remapping; in such cases, the keyboard and mouse will behave as though not remapped.
ja: ただし、リマッピングに対応していないゲームもあります。その場合、キーボードとマウスはリマッピングされていないものとして動作します。

source: However, some invalid addresses cannot be detected as such and may cause unpredictable behaviour.
ja: しかし、無効なアドレスの中には、それを検出できないものもあり、予測できない挙動を引き起こす可能性があります。

source: However, some methods require a more specific variant type, such as VT_BYREF | VT_I4.
ja: しかし、メソッドによっては、VT_BYREF | VT_I4のように、より特殊なバリアントタイプを要求するものもあります。

source: However, some system functions do not support it (or long paths in general).
ja: しかし、システム機能によっては（あるいは一般的に長いパスを）サポートしていないものもある。

source: However, some windows might need to be in a non-minimized state.
ja: ただし、一部のウィンドウは最小化しない状態が必要な場合があります。

source: However, sometimes a function completes before its effects can be seen by the user.
ja: しかし、その効果をユーザーが確認する前に機能が終了してしまうこともあります。

source: However, spaces are significant in some cases, including:
ja: しかし、スペースは次のようなケースでは意味を持ちます：

source: However, success may be reported even if the window has not moved, such as if the window restricts its own movement.
ja: しかし、ウィンドウが自身の動きを制限している場合など、ウィンドウが動いていなくても成功が報告されることがある。

source: However, such code can be placed throughout the file, in between (but not inside) function and class definitions.
ja: しかし、このようなコードは、関数やクラス定義の間（内部ではない）に、ファイル全体に配置することができます。

source: However, such data can be manipulated by retrieving the string's address with StrPtr and passing it to other functions, such as NumPut, NumGet, StrGet, StrPut, and DllCall itself.
ja: しかし、このようなデータは、StrPtrで文字列のアドレスを取得し、NumPut、NumGet、StrGet、StrPut、DllCall自身など他の関数に渡すことで操作することができます。

source: However, such functions should have fairly distinct names because they will still be in the global namespace; that is, they will be callable from anywhere in the script.
ja: しかし、このような関数は、グローバル名前空間に存在するため、かなり明確な名前を持つ必要がある。

source: However, such hotkeys typically cannot be triggered by Send and are more likely to interfere with other scripts than a standard keyboard accelerator.
ja: しかし、このようなホットキーは一般的にSendでトリガーすることができず、標準的なキーボードアクセラレータよりも他のスクリプトに干渉する可能性が高いです。

source: However, text sent to stdout will not appear at the command prompt it was launched from.
ja: ただし、stdoutに送られたテキストは、起動したコマンドプロンプトには表示されません。

source: However, the ColClick event is still raised, so the script can respond with a custom sort or other action.
ja: しかし、ColClickイベントはまだ発生するので、スクリプトはカスタムソートなどのアクションで応答することができます。

source: However, the Alt+CapsLock, Ctrl+CapsLock and Shift+CapsLock shortcuts can be disabled with a workaround.
ja: ただし、Alt+CapsLock、 Ctrl+CapsLockおよびShift+CapsLockのショートカットは、回避策で無効にすることができます。

source: However, the AND/OR operators always produce one of the input values.
ja: ただし、AND/OR演算子は常に入力値のいずれかを生成します。

source: However, the Blind mode does not prevent masking performed by the keyboard hook following activation of a hook hotkey.
ja: ただし、ブラインドモードでは、フックホットキー起動後のキーボードフックによるマスキングは防げません。

source: However, the above hotkeys vary under the following circumstances:
ja: ただし、上記のホットキーは以下の状況で変化する：

source: However, the auto-execute thread is not limited to just the top of the script.
ja: しかし、自動実行スレッドはスクリプトの先頭だけに限定されるわけではない。

source: However, the characters \.*?+[{|()^$ must be preceded by a backslash to be seen as literal.
ja: ただし、\.*?+[{|()^$の前にバックスラッシュがないとリテラルとみなされない。

source: However, the class prototypes are resolved at load time, and must be specified as a full class name and not an arbitrary expression (similar to y in class x extends y).
ja: ただし、クラスプロトタイプはロード時に解決されるため、任意の式ではなく完全なクラス名で指定する必要があります（class x extends yのyと同様）。

source: However, the direct equivalent of v1 try something() in v2 is:
ja: ただし、v2のv1try something()に直接相当するのは：

source: However, the existence of a method does not guarantee that it can be called, since there are requirements that must be met, such as parameter count.
ja: ただし、パラメータ数など満たすべき要件があるため、メソッドが存在しても呼び出せることを保証するものではありません。

source: However, the first unique expression with a given combination of criteria can also be referenced by that criteria.
ja: ただし、所定の条件の組み合わせを持つ最初のユニークな表現は、その条件によって参照することも可能です。

source: However, the function could instead be changed to explicitly dereference each VarRef.
ja: しかし、その代わりに、各 VarRef を明示的に非参照にするように関数を変更することができます。

source: However, the header will still behave visually like a button (unless NoSortHdr has been specified).
ja: ただし、NoSortHdrが指定されていない限り、ヘッダーはボタンのように視覚的に動作する。

source: However, the icon is converted back to a bitmap if the ImageType parameter is omitted.
ja: ただし、ImageTypeパラメータが省略された場合は、アイコンはビットマップに変換されます。

source: However, the icon is converted back to a bitmap if the OutImageType parameter is omitted.
ja: ただし、OutImageTypeパラメータが省略された場合は、アイコンはビットマップに変換されます。

source: However, the majority of scripts do not need to do this manually since a wrapper object is created automatically by ComObject, ComObjActive, ComObjGet and any COM method which returns an object.
ja: ただし、ComObject、ComObjActive、ComObjGet、およびオブジェクトを返すCOMメソッドでは、ラッパーオブジェクトが自動的に作成されるため、大半のスクリプトでは、これを手動で行う必要はない。

source: However, the majority of scripts do not need to do this manually since a wrapper object is created automatically by ComObject, ComObjArray, ComObjActive, ComObjGet and any COM method which returns an object.
ja: ただし、ComObject、ComObjArray、ComObjActive、ComObjGet、およびオブジェクトを返すCOMメソッドでは、ラッパーオブジェクトが自動的に作成されるため、大半のスクリプトでは手動で行う必要はない。

source: However, the names of keys must be spelled the same as in the existing hotkey (e.g. Esc is not the same as Escape for this purpose).
ja: ただし、キーの名前は既存のホットキーと同じスペルでなければなりません（例：この目的ではEscはEscapeと同じではありません）。

source: However, the ordering of multiple #Warn directives is significant:
ja: ただし、複数の#Warnディレクティブの並び順は重要です。

source: However, the ordering of multiple #Warn directives is significant: the last occurrence that sets a given warning determines the mode for that warning.
ja: ただし、複数の#Warnディレクティブの並び順は重要です。ある予告を設定した最後の発生で、その予告のモードが決定されます。

source: However, the part number might be a very large integer if the user clicks near the sizing grip at the right side of the bar.
ja: ただし、バー右側のサイズグリップ付近をクリックした場合、品番は非常に大きな整数になる可能性があります。

source: However, the pattern shown above will work even with other property names.
ja: しかし、上に示したパターンは、他のプロパティ名でも機能する。

source: However, the responsiveness of hotkeys might be better under some conditions if the keyboard hook is used instead.
ja: ただし、条件によってはキーボードフックを使用した方が、ホットキーの反応性が良くなる場合があります。
